Repository: henyee/NBDYSJCT
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: “嗯，这是我给父亲大人你们做的彩虹炒饭，你们太辛苦了，所以我想给你们做一份早餐呢。”艾米点着脑袋，看了一眼锅里的炒饭，又是有点不好意思道：“但……现在好像变成了黑土炒饭。”
en_us: "Yes. This is the rainbow fried rice that I have made for you guys. You guys have worked very hard, so I wanted to make breakfast for all of you." Amy nodded. She flicked a glance at the fried rice in the wok, embarrassed, and said, "But… it seems to turn into black soil fried rice now."

source: “嗯，这样就对了，走，去上次那家。”加兰欣然道。
en_us: "Mm. That's right. Let's go to the that place last time," Garlan said happily.

source: “嗯，那行。”麦格笑着点头，今天晚上的艾米的确懂得克制了，只吃了三个成年人的饭量而已。
en_us: "Mm-hmm. Alright." Mag nodded with a smile. Amy was indeed controlling herself tonight. She only ate as much food as three adults.

source: “嗯，非常有天赋。”麦格笑着点头，在这方面，艾米绝对是天才级别的。
en_us: "Mm. Very talented." Mag nodded with a smile. Amy is indeed very talented in this aspect.

source: “嗯？”
en_us: "Hm?"

source: “嗯？”伊琳娜看着他的脸微微一惊。
en_us: "Hmm?" Irina looked at him, stunned.

source: “嗯？”埃菲的身体微微发抖。
en_us: "Hm?" Eiffie started shaking.

source: “嗯？”就在他准备向着街对面的泰坦酒馆走去的时候，一丝淡淡的香味却让他停住了脚步。
en_us: "Hmm?" Just when he was about to walk to Titan Tavern, a faint alcoholic scent stopped him in his tracks.

source: “嗯？”正在楼顶晨练的麦格听到了动静，从阳台上探头向外一看，看到了穿着白色羽绒服的艾米，像个小雪球一般在雪地上蹦跳着离去。
en_us: "Mmm?" Mag, who was doing his morning exercise on the roof, heard the sounds and looked down. He saw Amy, who was wearing in a white jacket, skip away in the snow.

source: “嗯？”麦格顺手套上面具，向着门口走去，通过门洞看了眼，外边站着一位老人。
en_us: "Hmm?" Mag wore his mask, and walked to the door. He looked out of the peephole, and saw an old man standing outside.

source: “嗯？我是谁？我在哪？”伊琳娜睁开眼，眨了眨眼睛，有点懵。
en_us: Hmm? Who am I? Where am I? Irina opened her eyes. She blinked, a little confused.

source: “嗯？还有这种事情？”麦格挑眉，感觉好像哪里不太对？
en_us: "Hmm? There is something like that?" Mag raised his eyebrows. He felt that something was amiss?

source: “嗯？？？”
en_us: Huh?

source: “嗯？？？”诺亚一脸问号。
en_us: "Hmm???" Noah was full of question marks.

source: “嗯？？？”诺亚歪头看着麦格。
en_us: "Hm???" Noya looked at Mag with bewilderment.

source: “嗯？？？”麦格看着三人，寻思了一会，有些恍然，“原来你们是说你们要去逛街，并没有包括我是吧？”
en_us: "Hmm???" Mag looked at the three of them, and pondered for a moment before he suddenly realized what they meant. "So you guys didn't include me when you said you wanted to go shopping?"

source: “嗷呜。”被打扮成了小熊猫的丑小鸭打了个哈欠，趴在柜台上继续睡觉。
en_us: "Aoo." Ugly Duckling, who was dressed up as a panda, yawned and continued sleeping on the counter.

source: “嘘，别瞎说。”露娜脸一红，瞪了薇薇安一眼。
en_us: "Hush. Don't talk nonsense!" Luna blushed and glared at Vivian.

source: “嘘，父亲给你们带了好吃的。”帕萨把麦老板给他打包的花生和糖拿了出来，递给三个孩子。
en_us: "Hush. I brought you guys goodies." Pasa took out the peanuts and sweets Boss Mag had packed for him, and passed them to his three children.

source: “嘶~嘶——”巨蛇吐舌，俯身向着麦格冲来。
en_us: "Sss~sss—" The giant snake hissed and dashed downwards at Mag.

source: “嘶——”
en_us: "Ssss—"

source: “嘶……”手下倒吸了一口凉气，酸酸道：“那今天卖了房子的那些屋主们，估计得哭死了。”
en_us: "Ssshh..." The subordinate sucked in a breath of cold air and jealously said, "Those owners who sold their properties today are going to cry their hearts out."

source: “嘻嘻。”艾米的脸上露出笑容，又给安妮和伊琳娜各拿了一个蛋黄酥，自己才抓起最后一个蛋黄酥，放到嘴边，咬下一大口。
en_us: "Hehe." Amy smiled. She gave Annie and Irina one each before picking up the last salted egg yolk pastry, and took a big bite.

source: “嘻嘻。”艾米脸上露出了开心的笑容，不过心里却有点疑惑。
en_us: "Hehe." A happy smile appeared on Amy's face, but she was a little puzzled inwardly.

source: “嘻嘻！我就知道父亲大人最好了。”艾米开心道，小脸上满是笑容。
en_us: "Hehe! I knew Father is the best," Amy said happily with a smile.

source: “嘻嘻，好哒。”艾米开心点头。
en_us: "Hehe. Alrighty." Amy nodded happily.

source: “嘻嘻，好的。”艾米拎起地上比她体积还要大的零食大礼包，往肩上一扛，一边道：“我要把这些零食和安妮姐姐分享，这样就是双倍的快乐了。”
en_us: "Hehe, alright." Annie carried the snack hamper that was even bigger than her and put it on her shoulder while saying, "I'm going to share these snacks with Big Sister Annie. That way, it would be double the happiness."

source: “嘻嘻，谢谢父亲大人。”艾米捧着盒子走开，坐在楼梯口，小盒子放在手边，抓起一颗绿豆，冲着丑小鸭叫道：“丑小鸭，你要把它咬回来哦。”
en_us: "Hehe. Thank you, Father." Amy left with the box, and sat at the staircase. She placed the box by her side, and grabbed a handful of mung beans. Amy called out to Ugly Duckling, saying, "Ugly Duckling, you have to bring it back."

source: “嘻嘻，还是亚伯罕叔叔好，找到好吃的都会第一时间想到我。”温妮莎满是感激的看着亚伯罕。
en_us: "Hehe, Uncle Abraham, you're the best. You would always think of me the moment you found something delicious." Vanessa looked at Abraham gratefully.

source: “嘿嘿……”卡托拉尴尬一笑，冲着酒柜的方向道：“老板，不要介意哈，我这个人心直口快，你这酒，的确是好酒。”
en_us: "Hehe…" Cataula smiled awkwardly. He turned toward the bar counter, and said, "Sir, don't mind me. I speak before I think. Your alcohol is fantastic."

source: “嘿嘿。”亚伯罕心满意足的回了自己的座位，笑着自语：“小家伙说话真好听，要是艾米小老板说话有着一半就好了。”
en_us: "Hehe." Abraham returned to his seat with satisfaction as he mumbled to himself, "This little fellow is so obedient. If only Little Boss Amy spoke half as nicely as her."

source: “嘿嘿嘿。”老板发出了一串男人都懂的猥琐笑声。
en_us: "Hehehe." The boss made a series of obscene laughter that all men knew very well.

source: “嘿嘿，以后又多了一位难兄难弟了。”
en_us: "Hehe. We'll have another buddy-in-trouble soon."

source: “嘿嘿，她说的没错，多管闲事是要付出代价的。”巨汉脸上的憨笑消失，满脸横肉堆在一起，狞笑着举起了手中的巨斧，向着麦格劈下，嘴里吼道：“给爷死！”
en_us: "Hehe. She's right. You've to pay a price for being a busybody." The silly smile on the big guy's face disappeared. All the flesh on his face squeezed together and he lifted the giant axe up with a sinister smile. He swung the axe at Mag and yelled, "Die!"

source: “嘿嘿，客官说什么话呢，我看你技术越来越纯熟了，要不要再来十个圈？保证能套个大肥鹅回家，媳妇保管把你夸。”瘦干的地摊老板笑呵呵道，麻溜的吧地上的竹圈捡起来，一边笑着说道。
en_us: The lanky game stall boss chuckled, and quickly picked up the bamboo rings on the ground as he smilingly said, "Hehe, what are you talking about, dear customer? I can see that your technique is getting better, why don't you buy another 10 rings? I'm sure you will get a big, fat goose home, and your wife is going to praise you for it."

source: “嘿嘿，小娘皮往哪里跑！把钱全给大爷，再让大爷爽一爽，我不会杀你们的！”那壮汉狞笑着迈着大步向着埃菲她们追来，一路上桌椅板凳一律被撞开。
en_us: "Hehe. Where are you going, ladies?! Give me all the money and then let me have some fun. I won't kill you two!" That strapping man strode over and chased after Eiffie and Mala. All the tables and chairs were knocked out along his way.

source: “嘿嘿，我吃不到，你们也吃不到，这么一想，心情都变好了许多。”亚伯罕爬上了马车，道：“出发！”
en_us: "Hehe. I can't eat it, but neither can any of you. I feel better when I think like that." Abraham got into the horse-drawn carriage, and said, "Let's go!"

source: “嘿嘿，我就是照着书上背了几段，不过看起来效果还挺不错的，他们看我的目光都不一样了呢。”汉娜有点不好意思的笑了笑。
en_us: Hannah chuckled embarrassedly. "Hehe, I have only memorized a few paragraphs from the books, but it seems like the effects are quite good. They are looking at me differently now."

source: “噤声！此事不得妄议和外传，小心你们的脑袋！”一位中年护卫冷声喝道。
en_us: "Hush! Do not spread this around. Watch out for your heads!" a middle-aged guard chided coldly.

source: “嚯，你瞧瞧人家，昨天才刚买下半条街，当晚就住进去了，有钱人的想法，还真是让人捉摸不透啊。”
en_us: "Woah. Look at him. He bought half of the street yesterday, and moved in last night. Rich people's thoughts are really unfathomable."

source: “嚯，好可爱的小丫头。”众人看着那粉雕玉琢的小家伙，眼睛纷纷一亮，脸上不觉露出了笑容。
en_us: "Woah, what an adorable little girl." Everyone's eyes lit up as they looked at the exquisite little girl, and they couldn't help smiling.

source: “嚯，瞧瞧人家那酒馆，还没开门，就这么多大人等着了。”
en_us: "Woah, look at their tavern. There are already so many people waiting before it even opened."

source: “嚯，这一家子颜值可真高。”
en_us: "Woah. This family really looks good."

source: “回到你们的圈里去！你们这些愚蠢卑劣的家伙！”守卫们并不惊慌，魔法师已经开始构筑冰墙和土墙。
en_us: "Go back to your cells! You lowly and stupid fellows!" The guards didn't panic. The magic casters were already building ice walls and mud walls.

source: “回老爷，那家酒馆叫‘塞班酒馆’，开在罗莫街上。”管家小镇答道。
en_us: "My Lord, that tavern is called 'Saipan Tavern.' It's on Romo Street," the butler answered softly.

source: “因为父亲大人每天都那么辛苦，所以我想去买早餐，这样你就不用给我们做早餐了，可以多睡一会。”艾米的小脸上写满了认真。
en_us: "Because Father is working so hard every day so I thought that I should get breakfast and that way you would not have to make breakfast for us and can sleep in a little more," Amy said seriously.

source: “因为菜品未达到创造者的要求，系统判定任务尚未完成，请小主继续帮助父亲改进菜品，完成任务！”系统的声音响起。
en_us: "As the dish did not reach the creator's expectation, the System would deem the mission as unfinished. Please continue to assist your Father in improvign the dish to complete the mission!" the System's voice rang.

source: “圆滚滚，软萌萌的，晚上抱着睡觉一定超舒服。”
en_us: "Roly-poly and soft. It must feel great to cuddle it when sleeping at night."

source: “圣光啊，审判这个邪恶！让一切归于平静吧！”
en_us: "Holy Light, judge this evil! Let everything return to calmness!"

source: “圣光啊，涤荡一切污浊与黑暗吧。”伊琳娜举起法师杖，隐藏道。
en_us: "O' Holy Light, wipe out all darkness and filth," Irina chanted as she raised her magic caster's staff.

source: “圣光术加上超强的治疗魔法，这样的年轻十级强者，恐怕也只有精灵族的那位公主了。”梅兰特笑着道。
en_us: "The Holy Light, combined with powerful healing magic. A 10th-tier powerhouse as young as her, I guess it would only be the elven princess," Merante said with a smile.

source: “在哪呢？”
en_us: "Where is it?"

source: “在家？”
en_us: "At home?"

source: “在这方面，我还是挺有天赋的。”麦格微笑道。
en_us: "I am rather talented in this aspect," Mag said smilingly.

source: “在这里。”麦格表情略微一僵，想到了自己刚刚在门口那得意的模样，不过还是乖乖的从钱袋里把今晚的营业额尽数掏出来交给伊琳娜。
en_us: "Here." Mag froze for a while. He recalled his arrogance at the door just now, but still handed over the money bag with today's earnings to Irina obediently.

source: “在这里！”
en_us: "She's over here!"

source: “地……地……”大蛇的眼睛突然闪烁起来，竟是从麦格的控制中挣脱出来，竖瞳重新恢复，发出了一声嘶吼，向着麦格扑而来。
en_us: "Un...Un..." The big snake's eyes suddenly flickered. It actually got out from Mag's control and its vertical pupils regained its conciousness. It let out a hissing roar and pounced onto Mag.

source: “地下世界、第一守则、地下城……”麦格感觉自己又获得了一些新的信息。
en_us: "Underground World, the first rule, Underground City..." Mag felt that he had received some new information.

source: “地动当然有感受到，房子有明显的震动，还有官差来询问。”麦格点点头，一脸坦荡道：“不过你说的是我们家隔壁的隔壁的房子吧？那的确是我的屋子，但一直空置着，姑娘要是想去瞧瞧，我可以给你开门。”
en_us: "Of course, I felt the earthquake. The house shook obviously and officials came to ask questions." Mag nodded and said with an honest expression, "However, are you talking about the house, next, next to us? That is indeed my property, but it has always been vacant. I can open the door for you if you would like to go see it, Miss."

source: “地底之下有另一个世界？”伊琳娜脸蛋微红，气息还有些喘，但还是好奇的问道。
en_us: "There's another world underground?" Irina asked curiously even though she was blushing and had a little shortness of breath.

source: “坏蛋呢？”艾米看着麦格问道。
en_us: "Where's the baddie?" Amy asked Mag.

source: “坐着，我给你去烧点水洗脚。”克莱拉把帕萨往床上一放，说道。
en_us: "Take a seat. I'll boil some water for you to wash your feet," Clara said as he put Pasa on the bed.

source: “埃菲啊……你真是一个糟糕的女人……”许久之后，埃菲把画册重新塞回被子下，目光有些迷离的拉上窗帘。
en_us: "Eiffie... you're a terrible woman..." After a long time, Eiffie stuffed the book back under her blanket and looked dreamily toward the drawn curtains.

source: “埃菲姐姐是个好人，如果没有她的话，那老板都不肯把那个汤卖给我呢。”艾米看着埃菲的背影说道。
en_us: "Big Sister Eiffie is a good person. Without her, the owner of the restaurant would never sell the soup to me," Amy said as she watch Eiffie leave.

source: “埃菲姐姐那里就有很多小姐姐呀，为什么不找她介绍呢？”在一旁的玩耍的艾米突然说道。
en_us: Amy, who was playing at the side, suddenly said, "Big Sister Eiffie has a lot of big sisters with her. Why don't we ask her to recommend us a few of them?"

source: “埃菲姐姐，你今天好漂亮。”艾米看着穿着一身红色长裙的埃菲，眼睛亮晶晶的说道。
en_us: "Big Sister Eiffie, you're very pretty today," Amy said as her eyes sparkled, looking at Eiffie in her long red dress.

source: “埃菲姐姐，父亲大人邀请你和玛拉姐姐中午去我们那里吃午饭呢。”艾米乖巧的说道。
en_us: "Big Sister Eiffie, Father would like to invite you and Big Sister Mala over for lunch at noon later." Amy said well-behavedly.

source: “埃菲小姐不必客气，我现在去取酒来，还要劳烦你帮忙报名参加那品酒大会。”麦格微微摇头道。
en_us: "You're being too polite, Miss Eiffie. I'll go get the liquor now and I'll need you to help me to register for that liquor tasting." Mag shook his head slightly.

source: “埃菲小姐别误会，我是想说，天赋是上天决定的，如果一件事情的确不适合我们的话，我们可以适当的放弃。”麦格解释道。
en_us: "Miss Eiffie, please do not misunderstand me. What I mean is, sometimes, talent is predestined. If something is not suitable for us, we can give it up," Mag explained.

source: “埃菲小姐太客气了，一点小事而已，你也帮忙报名了。”麦格硬着头皮站起来，看着埃菲客套道：“坐一会吧，这么冷，喝杯热茶。”
en_us: "Miss Eiffie is being too polite. It's just a small matter. You helped me to register too." Mag forced himself to stand up and make polite small talk with Eiffie, "Please sit down. It's so cold. Let's have a cup of hot tea."

source: “埃菲小姐是吧，不知找我的男人什么事？”伊琳娜饶有兴趣的看着埃菲问道。
en_us: "Miss Eiffie, right? Why are you here looking for my man?" Irina asked Eiffie with interest.

source: “埃菲小姐酿酒的时候，是否云雾缭绕，酒香四溢？”麦格笑吟吟的问道。
en_us: "Miss Eiffie, when you brew your wine, is there white smoke and wine fragrance coming out?" Mag asked with a smile.

source: “埃菲小姐，别这样。”麦格收回了自己的小手，向后退了一步，“还有人在，不合适。”
en_us: "Miss Eiffie, don't do this." Mag retracted his hand and took a step back. "There are people around. This is inappropriate."

source: “埃菲小姐，我非常尊重与喜爱马库斯大师，他是一位天才酿酒师，更是一个执著且坚定的酿酒师，哪怕已经过去十五年，他和泰坦酒的传奇依旧铭刻在我们的心中。”库尔特站着看着坐在台下的埃菲，神情有些复杂道：“非常感谢你让我们再次感受到他无与伦比的魅力，但根据品酒大会的规则，孤品藏酒是不能用于参赛的，因为这意味着客人在你的酒馆中无法购买到它。”
en_us: "Miss Eiffie, I respect and like Master Marcus very much. He was a genius brewer and one who was dedicated and persistant. The legend of him and his Titan Liquor is still entrenched in our hearts even after 15 years." Kurt stood and emotionally said to Eiffie, sitting under the stage, "Thank you very much for letting us feel his unparallel charm again, but according to the liquor tasting event's rules, a liquor that is no longer being brewed cannot take part in the competition because this means that your customers are not able to buy it in your tavern."

source: “埃菲小姐，玛拉，你们没事吧？”麦格看着埃菲微笑着问道，语气中带着关切之意。
en_us: "Miss Eiffie, Mala, are you alright?" Mag asked as she looked at Eiffie with a smile.

source: “埃菲小姐，请进来吧。”麦格的声音从里边响起。
en_us: "Please come in, Miss Eiffie." Mag's voice rang out from within.

source: “埃菲老板娘，你的脸色怎么不太好啊？”胖老板回头，看到站在他身后的埃菲，有些关心的问道。
en_us: The fat boss turned around to Eiffie, who was standing behind him, with concern, and asked, "Lady Boss Eiffie, you don't look very well?"

source: “城主，麦米餐厅突然发布公告歇业一个月，麦老板带小老板出门游玩取材去了。”迪克斯给迈克尔汇报完工作，顺便提了一句。
en_us: "My Lord, Mamy Restaurant suddenly declared that it would be closed for one month. Boss Mag is bringing the Little Boss out for a vacation and searching for ingredients," Dicus mentioned after he finished reporting to Michael.

source: “城北的酒馆一条街，现在同等的商铺价格在五百万左右。”费奇努力让自己的表情不那么酸。
en_us: "The smiliar shopfronts on tavern street at the north of the city cost about 5000,000." Fitch was trying not to look too jealous.

source: “基？我们那是纯洁的兄弟情……兄弟情懂吗？”波比歪头看着伊琳娜，加大了几分音量强调道。
en_us: "Gay? That's pure brotherhood… brotherhood, okay?" Bobby tilted his head, and he looked at Irina as he emphasized the important part loudly.

source: “塞班酒馆？”
en_us: "Saipan Tavern?"

source: “塞班酒馆？”亚伯罕若有所思。
en_us: "Saipan Tavern?" Abraham was thoughtful.

source: “外面做的不好吃，不如我们自己买一些绿豆回家试着做一做吧。”麦格提议道，这条街已经逛的差不多了。
en_us: "Since the ones outside are bad, why don't we buy some mung beans back home and try to make it on our own?" Mag suggested. They were almost done shopping around this street.

source: “外面出现了一个强大而可怕的不明生物，请小主务必苟住！”系统连忙答道。
en_us: "An unknown powerful and terrifying creature has appeared out there. Please remained indoors, little mistress." The system quickly answered.

source: “外面的世界，究竟是怎样的？”伊琳娜好奇的问道。
en_us: "What is the world outside like?" Irina asked curiously.

source: “外面都这么说，现在洛都城里都已经传遍了呢，肯定没假的。”小二点头笃定道。
en_us: "They are talking about this out there. The news has already spread throughout Rodu, so it has to be true." The waiter nodded with conviction.

source: “多好的黄瓜啊，丢了多可惜。”艾米端着盆就走了，一遍嚼着拍好的黄瓜，一边道：“那这些就交给我吧，我会把他们全部吃完的。”
en_us: "That's a lot of cucumber. What a pity to throw them away." Amy took the basin with her and said as she ate the smashed cucumners, "In that case, hand them over to me. I'll eat them all up."

source: “大主教大人，您现在打算怎么办呢？”卡诺小心翼翼的问道，他有点担心希利抢孩子，这里毕竟是混乱之城，而且尤利安就住在隔壁不远的地方。
en_us: "Lord Archbishop, what do you plan to do now?" Canault carefully asked. He was a little worried that Seely would snatch the child. After all, they were in Chaos City, and Urien was living close by.

source: “大人。”同桌的法部官员也是有些懵，没想到在这小酒馆里，还有敢这样对奥尔登的人。
en_us: "Sir." The other law officials were also stunned. They did not expect someone in this small tavern to do such a thing to Aulden.

source: “大人不必怜悯，一瓶酒而已，既然他们请不起服务员，那总得找个人给我们倒酒不是。”奥尔登笑着摆摆手，看着坐在柜台后不为所动的艾米脸色一冷道：“小鬼，听不到我说话吗？”
en_us: "Sir, there is no need to sympathize with her. It's just a bottle of wine. Since they can't afford service staff, someone got to pour the wine for us, right?" Aulden waved his hand with a laugh. He looked at Amy, who was still sitting behind the counter, and said coldly, "Little brat, didn't you hear what I say?"

source: “大人，我们兵分四路追踪，但还是失去了那二人的踪迹。”一位骑士上前禀报道。
en_us: "Sir, our soldiers have split up to trace them, but we've still lost their tracks," one of the knights reported.

source: “大人，我们坐这边吧。”波比领着卢西恩在靠近门口的位置坐下，他看得出卢西恩的神态变化，心里倒也不慌，这家酒馆看起来平平无奇，那是因为还没有上酒啊。
en_us: "Sir, let's take a seat there." Bobby brought Lucien to a seat near the door. He could tell the change in Lucien's expression, but he was not flustered. This tavern might look ordinary, but that was because the wine was not served yet.

source: “大人，我昨天喝了茅台酒，要不今天也点一瓶这个试试？”波比看着卢西恩征询道。
en_us: "Sir, I had Maotai yesterday. Why don't we try a bottle of that today?" Bobby asked Lucien.

source: “大人，既然你是官，对一个小朋友提出这样的要求，就不太妥当吧。”麦格从厨房里走了出来，手里还握着一把菜刀，站在了艾米的身旁，看着奥尔登说道。
en_us: "Sir, since you're an official, isn't it inappropriate to bring up such a request to a child?" Mag walked out from the kitchen with a cleaver in his hand as he stood beside Amy.

source: “大人，求您救救我爷爷吧。”诺亚恳求道。
en_us: "Please, save my grandpa," Noya pleaded.

source: “大人，要给您备车入宫吗？”管家小声问道。
en_us: "My Lord, should I prepare the carriage for you to go to the palace?" the butler asked softly.

source: “大叔，这你就不知道了吧，这可是我们的男神第一次接受杂志的正式访谈，而且据说杂志里边还有他的画像呢。”那小姑娘看了他一眼，有些兴奋的说道。
en_us: That young maiden flicked him a glance before excitedly saying, "Mister, you might not know, but this is the first time that our idol is accepting a magazine's interview formally. Moreover, it's said that there is a picture of him in the magazine."

source: “大圣诚不欺我。”麦格看着掌心中的金色小棒槌，忍住了把它塞进耳朵的冲动。
en_us: "The Monkey King did not lie to me indeed." Mag looked at the tiny golden bludgeon in his palm, and resisted the urge to put it in his ear.

source: “大大大……”麦格继续念着，绣花针大小的擀面杖开始膨胀，很快涨到了三米的高度，砸厨房里顶天立地。
en_us: "Big, big, big…" Mag continued to chant. The needle-sized roller pin slowly expanded, and quickly became three meters tall, touching the ceiling and reaching the floor.

source: “大家先玩着吧，一会做好了我再叫大家过来吃。”麦格也是笑着说道，把两个烧烤架摆开，然后把冰激凌机架起来。
en_us: "You guys play first. I will call all of you over when it's done," Mag said as he opened up the two grills and set up the ice cream machine, also smiling.

source: “大将军这是？！”
en_us: "The great general is?!"

source: “大概也只有男爵大人才有这样的气质吧。”
en_us: "Prbably only the Baron has such awe around him."

source: “大概知道一些吧。”麦格抓了一把绿豆，诺兰大陆的绿豆要更大一些，差不多有黄豆那么大颗，颗粒饱满，表面圆润光滑，手感相当不错。
en_us: "A little, roughly." Mag grabbed a handful of mung beans. The mung beans on the Norland Continent were slightly larger, around the size of soybeans. Each bean was round and smooth.

source: “大男子汉，吃个小甜点都哭哭啼啼的。”梅兰特有些鄙夷的说道。
en_us: "A grown man weeping over a tiny dessert," Merante said disdainfully.

source: “大白天的，就不喝酒了吧。”麦格摇头，看着埃菲道：“关于品酒大会，想向埃菲小姐请教一下详细的内容。”
en_us: "It's early in the morning, I shall not drink." Mag shook his head. He looked at Eiffie and said, "I would like to ask you about the details of the liquor tasting event."

source: “大祭司饶命啊……”
en_us: "High Priestess…"

source: “大祭司饶命！”
en_us: "Spare us, High Priestess!"

source: “大祭司，各大家族都遭到了洗劫和奴隶出逃的情况，请您下令让护卫队出击，抓捕那些暴乱分子吧！再这样下去，风之森林可就真的垮了。”一位中年精灵满脸担忧的看着坐在高台之上的海伦娜说道。
en_us: "High Priestess, in the current situation where all the noble families are under attack, and their slaves are escaping, please order the garrison to arrest those rioters! The Wind Forest will collapse if this continues," a middle-aged elf worriedly said to Helena, who was sitting on the platform.

source: “大祭司，奎恩特家族和巴萨特家族的族长求见，说想要亲自见您，有话想要当面汇报。”一位精灵走进星空洞府，看着高台上背对着洞口盘坐着海伦娜说道。
en_us: "High Priestess, the Quant Family's and Basat Family's leaders would like to see you. They have something to report to you." An elf entered the Starry Cave, and reported to High Priest Helena, who was sitting on the elevated platform with her back facing the cave entrance.

source: “大祭司，生命之城中越来越多的家族宣布烧毁奴隶契约，还族中奴仆自由身，场面已经失去控制。”
en_us: "High Priestess. More and more families in the City of Life have announced that they would be burning the slave contract and returning their slaves' freedom to them. The situation has gone out of control.

source: “大祭司，请宽恕我们的，我们对精灵族和您都是忠诚的。”
en_us: "High Priestess, please forgive us. We are loyal to you and the elven race."

source: “大胆……”一旁的护卫面色一冷，这小丫头竟敢这般称呼公爵大人。
en_us: "How dare you…!" The guard at the side turned solemn. How dared this little girl call the lord duke that.

source: “大转盘是概率抽奖，本系统无法保证小主获得的奖品是什么。”系统解释道。
en_us: "The big wheel is a lucky draw based on probability. I am unable to guarantee what your prize would be," the System explained.

source: “天呐，不是这样子滴，要先穿过来才对，你好笨哦。”
en_us: "Oh heavens. It's not like this. You have to go through here first. You are so stupid.

source: “太可怕了……”诺亚瘫坐在地上，浑身被汗水湿透，仿佛虚脱了一般。
en_us: "It's so terrifying..." Noah slumped onto the ground. He was soaked with sweat as though he was exhausted.

source: “太好了！父亲大人我爱你。”艾米开心的跳起来，抱着麦格的脖子在他的脸上亲了一口。
en_us: "Fantastic! I love you, Father." Amy jumped up happily, hugged Mag, and kissed him on his cheeks.

source: “太好了！竟然增加了一个金奖！”埃菲惊喜的快要跳起来。
en_us: "Marvellous! They actually added another gold award!" Eiffie also jumped up in joy and surprise.

source: “太好了！这个黄瓜真的很好吃呢。”艾米脸上同样满是笑容。
en_us: "That's great! This cucumber is really delicious." Amy was all smiles as well.

source: “太好了，太好了。”玛拉小心抚摸着金奖杯，眼泪已经不争气的往下掉。
en_us: "That's great. That's great." Mala caressed the gold award's trophy carefully as tears flowed.

source: “太好了，洛都可好玩了，可是去了两次都没有玩尽兴呢。”艾米开心的说道，然后转身蹬蹬蹬上楼收拾东西去了。
en_us: "Fantastic. Rodu is fun, but I haven't gotten to play everything even after visiting twice," Amy said happily before she ran upstairs to pack her stuff.

source: “太好吃了，哈迪斯先生，您收我为徒吧，我想跟你学做菜。”玛拉放下筷子，一脸崇拜的看着麦格，表情还颇为诚挚。
en_us: "This is too good. Mr. Hades, please accept me as your disciple. I want to learn from you." Mala put her chopsticks down and looked at Mag with sincerity and admiration.

source: “太阳公公都晒屁股了哦。”艾米也是笑眯眯的说道。
en_us: "The sun is already shining down on your butt," Amy also smilingly said.

source: “夫人好像并没有很高兴的样子。”埃菲看着伊琳娜离开的背影，有点疑惑的说道。
en_us: Eiffie watched Irina's retreating back and asked with befuddlement, "Your wife doesn't look very happy."

source: “失败。”麦格将那啪坏了的黄瓜丢到一旁的盆里，重新取了一根黄瓜。
en_us: "Fail." Mag threw the smashed cucumber into a basin at the side and took another cucumber.

source: “奇怪的知识又增加了。”麦格稍微吸收了一下，然后开始转述给艾米。
en_us: "I gained more weird knowledge now." Mag absorbed them briefly before imparting them to Amy.

source: “套圈可是要钱钱的哦，你大人呢？如果想玩的话，是五个铜币一个圈圈。”老板笑眯眯的说道，这可是送上门的小肥羊。
en_us: "You will need to pay money to ring the geese. Where are your parents? One ring costs five copper coins," the boss said smilingly. This was a little sucker who had sent herself right to him.

source: “套鹅了，套鹅了！五个铜币一个圈，套中的大鹅带回家，红烧、烧烤、炖汤了嘞！“
en_us: "Ring the goose, ring the goose! Five copper coins for one ring. You can bring the big goose home when you ring it. You can braise it, barbecue it, or make it into a soup!"
